benchmark/web/results/result_w8_2.log
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/json
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 31 sec, 294 millisec and 696 microsec, 159771 req/s, 46339 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1485000000 bytes total, 1105000000 bytes http, 380000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/json
Running 1m test @ http://10.0.1.3:8080/json
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms    2.41ms  93.85ms   96.33%
    Req/Sec    21.36k     2.43k   27.20k    69.16%
  Latency Distribution
     50%  713.00us
     75%    0.91ms
     90%    1.16ms
     99%   15.06ms
  10216061 requests in 1.00m, 2.83GB read
Requests/sec: 169984.86
Transfer/sec:     48.15MB
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/resource?count=256
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 30 sec, 626 millisec and 169 microsec, 163259 req/s, 61062 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1915000000 bytes total, 635000000 bytes http, 1280000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/resource?count=256
Running 1m test @ http://10.0.1.3:8080/resource?count=256
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.11ms    2.39ms  83.27ms   96.30%
    Req/Sec    22.11k     1.82k   26.60k    70.80%
  Latency Distribution
     50%  670.00us
     75%  825.00us
     90%    1.04ms
     99%   15.18ms
  10575987 requests in 1.00m, 3.77GB read
Requests/sec: 175973.66
Transfer/sec:     64.28MB
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/resource?count=4096
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 39 sec, 774 millisec and 613 microsec, 125708 req/s, 518546 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 21120000000 bytes total, 640000000 bytes http, 20480000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/resource?count=4096
Running 1m test @ http://10.0.1.3:8080/resource?count=4096
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.67ms    3.23ms  77.07ms   94.02%
    Req/Sec    16.61k     1.69k   21.16k    67.16%
  Latency Distribution
     50%  826.00us
     75%    1.16ms
     90%    1.82ms
     99%   18.37ms
  7947418 requests in 1.00m, 31.26GB read
Requests/sec: 132236.54
Transfer/sec:    532.69MB
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/resource?count=65536
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 282 sec, 1 millisec and 516 microsec, 17730 req/s, 1136979 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 328325000000 bytes total, 645000000 bytes http, 327680000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/resource?count=65536
Running 1m test @ http://10.0.1.3:8080/resource?count=65536
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.14ms    9.17ms 135.61ms   88.73%
    Req/Sec     2.23k   244.41     3.90k    70.09%
  Latency Distribution
     50%    6.16ms
     75%    8.52ms
     90%   20.09ms
     99%   49.78ms
  1066098 requests in 1.00m, 65.20GB read
Requests/sec:  17738.63
Transfer/sec:      1.08GB
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 82 sec, 240 millisec and 511 microsec, 60797 req/s, 16980 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1430000000 bytes total, 1360000000 bytes http, 70000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/
Running 1m test @ http://10.0.1.3:8080/
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.45ms    2.96ms  89.44ms   96.40%
    Req/Sec     7.90k   815.88    12.39k    70.22%
  Latency Distribution
     50%    1.85ms
     75%    2.46ms
     90%    2.84ms
     99%   19.00ms
  3778441 requests in 1.00m, 1.01GB read
Requests/sec:  62869.02
Transfer/sec:     17.15MB